{"recommendations":[{"id":"[[CK_Antidiskriminierungscheckliste]]","text":"In Ihrem KI-Vorhaben könnte die Gefahr einer unbeabsichtigten Diskriminierung bestehen. Die Antidiskriminierungsstelle des Bundes hat dazu eine Handreichung veröffentlicht, die über die rechtlichen Hintergründe aufklärt und Lösungsvorschläge bietet. \n[Antidiskriminierungsstelle - Publikationen - Studie \"Diskriminierungsrisiken durch Verwendung von Algorithmen\", Dr. Carsten Orwat](https://www.antidiskriminierungsstelle.de/SharedDocs/downloads/DE/publikationen/Expertisen/studie_diskriminierungsrisiken_durch_verwendung_von_algorithmen.html)\n\nGgf. Direkt-Download der Datei anbieten.","title":"CK Antidiskriminierungscheckliste","files":[]},{"id":"[[CK_Compliance Officer]]","text":"In Ihrem Fall ist der Aufbau bzw. Einbezug eines Compliance Officers sinnvoll. Diese Rolle hat die Aufgabe, sich über aktuelle Gesetzesänderungen zu informieren und KI-Vorhaben beratend zu begleiten. Die Rolle kann auch von einem externen Rechtsanwalt übernommen werden, wenn Sie diesen nur in Einzelfällen zu Rate ziehen möchten.","title":"CK Compliance Officer","files":[]},{"id":"[[CK_Supply Chain Dokumentation]]","text":"In Ihrem Fall ist es notwendig, die Lieferkette der KI-Lösung im Rahmen des Gesetzes über die unternehmerischen Sorgfaltspflichten zur Vermeidung von Menschenrechtsverletzungen in Lieferketten zu erfassen. \nIm KI-Umfeld geht es dabei vorrangig um die Arbeitsbedingungen von Click-Workern, die zum Labeling von Trainingsdaten eingesetzt werden. \nLieferanten können hier Audits durchführen lassen und Sie können diese Zertifikate als Nachweise anfordern. \n\nGlossar-Links: Labeling, Trainingsdaten, Click-Worker, Audit","title":"CK Supply Chain Dokumentation","files":[]},{"id":"[[CK_Interne Meldestelle]]","text":"In Ihrem Unternehmen kann eine interne Meldestelle (z.B. in Form einer Ombudsperson) aufgebaut werden, die für unternehmensinterne kritische Themen als Ansprechpartner*in zur Verfügung steht. \nNötig sind dazu auch anonyme Meldewege wie ein Briefkasten oder eine technische Lösung wie die Open-Source-Anwendung Secure Drop [Overview (securedrop.org)](https://securedrop.org/overview/)Zuletzt muss die Möglichkeit, Problemfälle intern zu melden, im Unternehmen bekannt gemacht werden. \nDetails dazu regelt das Hinweisgeberschutzgesetz: [HinSchG - Gesetz für einen besseren Schutz hinweisgebender Personen (gesetze-im-internet.de)](https://www.gesetze-im-internet.de/hinschg/BJNR08C0B0023.html)","title":"CK Interne Meldestelle","files":[]},{"id":"[[DS_Anonymisierung]]","text":"In Ihrem Fall ist die Anonymisierung der verwendeten Daten eine Option. Konkret darf aus den Daten keinerlei Zusammenhang zu Personen mehr herstellbar sein - weder direkt noch indirekt. \nDie Anonymisierung kann z.B. mit Hilfe des Open-Source-Tools \"ai-privacy-toolkit\" durchgeführt werden. [GitHub - IBM/ai-privacy-toolkit: A toolkit for tools and techniques related to the privacy and compliance of AI models.](https://github.com/IBM/ai-privacy-toolkit)\nDies gestaltet sich in der Praxis oft schwierig, da oft und zunehmend Rückschlüsse auf Personen möglich sind, auch wenn kein direkter Personenbezug mehr in den Daten vorhanden ist. Deshalb ist die Pseudonymisierung oft die bessere Alternative. \n\nGlossar: Anonymisierung, Pseudonymisierung","title":"DS Anonymisierung","files":[]},{"id":"[[DS_Beauftragter_extern]]","text":"In Ihrem Fall empfehlen wir die Beauftragung eines externen Datenschutzbeauftragten. Dieser sollte über das notwendige Knowhow verfügen, um Sie in Ihrem Fall zu beraten. \nBeispielsweise könnte dies ein spezialisierter Rechtsanwalt mit Kenntnis internationaler Datenschutzbedingungen sein. Sie finden diese im amtlichen Anwaltsverzeichnis des Bundes:  [Bundesweites Amtliches Anwaltsverzeichnis (bea-brak.de)](https://bravsearch.bea-brak.de/bravsearch/index.brak)","title":"DS Beauftragter extern","files":[]},{"id":"[[DS_Beauftragter_intern]]","text":"Ein interner Datenschutzbeauftragter empfiehlt sich zur Ergänzung des Projektteams. Dessen Aufgabe ist es, Empfehlungen zur Umsetzung der DSGVO auszusprechen und gangbare Alternativen bei potenziellen Konflikten vorzuschlagen. \n\nGlossar: Datenschutzbeauftragter","title":"DS Beauftragter intern","files":[]},{"id":"[[DS_Beauftragter_keinen]]","title":"DS Beauftragter keinen","files":[]},{"id":"[[DS_DSGVO-Datenaufbewahrung]]","text":"","title":"DS DSGVO-Datenaufbewahrung","files":[]},{"id":"[[DS_DSGVO-Auftragsdatenvereinbarung]]","text":"Sie sollten eine Vereinbarung zur Auftragsdatenvereinbarung gemäß DSGVO abschließen. Diese ermöglicht es, dass Sie Daten zur Verarbeitung an Dritte (z.B. einen Cloud-Anbieter oder einen externen Dienstleister) weitergeben dürfen. \nAuch in eine ggf. notwendige Einwilligung zur Datenverarbeitung wäre dies aufzunehmen.","title":"DS DSGVO-Auftragsdatenvereinbarung","files":[]},{"id":"[[DS_DSGVO-Beratung]]","text":"Sie sollten sich zur Einhaltung der DSGVO beraten lassen. Dies kann z.B.. durch einen Datenschutzbeauftragten oder durch einen Fachanwalt für Datenschutzrecht geschehen. \nSie finden diese im amtlichen Anwaltsverzeichnis des Bundes:  [Bundesweites Amtliches Anwaltsverzeichnis (bea-brak.de)](https://bravsearch.bea-brak.de/bravsearch/index.brak)","title":"DS DSGVO-Beratung","files":[]},{"id":"[[DS_Klardaten]]","text":"","title":"DS Klardaten","files":[]},{"id":"[[DS_Pseudonomysierung]]","text":"Eine Pseudonymisierung der personenbezogenen Daten ist häufig empfehlenswert. Wenn Sie dies umsetzen, dann müssen Sie die Vorgaben der DSGVO beachten. \n\nGlossar: Pseudonymisierung","title":"DS Pseudonomysierung","files":[]},{"id":"[[DS_DSGVO-Löschung]]","text":"Entsprechend der DSGVO müssen Möglichkeiten zur zeitnahen Löschung von Daten und Trainingsdaten angeboten werden, wenn die betroffenen Personen dies verlangen. \n\nIn Ihrem Unternehmen sollten Sie dafür einen entsprechenden Prozess vorsehen, um auf entsprechende Anfragen vorbereitet zu sein.","title":"DS DSGVO-Löschung","files":[]},{"id":"[[DS_keine Entpersonalisierung]]","text":"In diesem Fall ist es nicht notwendig, die Daten zu anonymisieren.","title":"DS keine Entpersonalisierung","files":[]},{"id":"[[DZ_Klare Zuständigkeiten]]","text":"Für die Festlegung von Zuständigkeiten bietet sich eine sogenannte RACI-Matrix an. Die für Ihren Fall passende Empfehlungen finden Sie unten als Excel-Template zum Download. \n\nBitte beachten Sie, dass teilweise eine Person mehrere Rollen innehaben kann. \n\nDownload des entsprechenden Templates.","title":"DZ Klare Zuständigkeiten","files":[]},{"id":"[[DS_DSGVO-Einwilligung]]","text":"Im beschriebenen Fall scheint eine Einwilligung durch die Personen, deren Daten gemäß DSGVO verarbeitet werden, notwendig zu sein.","title":"DS DSGVO-Einwilligung","files":[]},{"id":"[[EAB_AbstrahierteAbnahmemuster]]","text":"Für die Abnahme der KI-Lösung empfiehlt sich bei mehreren ähnlichen Vorhaben die Verwendung von Mustern bei der Abnahme. Auf diese Weise müssen sich wiederholende Sachverhalte nur einmal geprüft werden.","title":"EAB AbstrahierteAbnahmemuster","files":[]},{"id":"[[EAB_Shadow Modus]]","text":"Um sicherzustellen, dass die KI-Lösung korrekte Ergebnisse produziert, kann sie vor dem offiziellen Einsatz in einer Test-Phase parallel im Hintergrund mitlaufen. Damit können Sie reale Ergebnisse, die von Mitarbeitern oder einer bestehenden Legacy-Software erzeugt werden, mit den Ergebnissen der KI abgleichen.","title":"EAB Shadow Modus","files":[]},{"id":"[[EAB_Abnahmecheckliste]]","text":"Für die Abnahme der KI-Lösung empfiehlt sich die Verwendung einer Checkliste. Einen entsprechenden Vorschlag finden Sie hier zum Download. Sie können diese selbstverständlich um eigene Kriterien erweitern. \n\nDownload Template Abnahmecheckliste.","title":"EAB Abnahmecheckliste","files":[]},{"id":"[[EAB_SLA]]","text":"Sie sollten mit dem Betreiber der KI-Lösung - sei es ein interner oder ein externer Betreiber - Service Level Agreements abschließen. \n\nGlossar: SLA","title":"EAB SLA","files":[]},{"id":"[[EAB_Interne Anwendung]]","text":"Ihre KI-Lösung wird als OnPremise-Lösung auf eigenen, unternehmensinternen Servern betrieben. Dies sollte mit der IT-Abteilung abgestimmt werden. Auch sollten Sie Aspekte der IT-Sicherheit wie Verfügbarkeit berücksichtigen.","title":"EAB Interne Anwendung","files":[]},{"id":"[[EAB_lokaler Ansprechpartner]]","text":"Sie sollten an jedem Einsatzort der KI-Lösung einen lokalen Ansprechpartner haben, der die KI-Lösung betreut und überwacht. Werden Probleme erkannt, kann der Ansprechpartner als 1st-Level-Support weitere Maßnahmen - wie Abschaltung der KI, Eskalation oder Re-Training einleiten. \nEs bietet sich an, dafür ein Key-User-Konzept für Personen aus dem entsprechenden Fachbereich einzuführen. \n\nGlossar: Key-User","title":"EAB lokaler Ansprechpartner","files":[]},{"id":"[[ITS_Monitoring und Alerting]]","text":"Sie können ein Monitoring der KI-Lösung implementieren, das eine Alarmierung bei Nicht-Verfügbarkeit der KI-Lösung auslöst. \nEin Prozess, der bei Problemen ausgelöst wird, muss mit den beteiligten Personen ebenfalls festgelegt werden. \nAls Tools eignen sich beispielsweise passende individuelle Skripte oder gängige Netzwerk-Monitoring-Werkzeuge.","title":"ITS Monitoring und Alerting","files":[]},{"id":"[[ITS_Verschlüsselung]]","text":"Daten sollten verschlüsselt werden. Dafür eignen sich gängige Verfahren. \nZu unterscheiden ist zwischen der Transportverschlüsselung für die Übertragung der Daten (meist HTTPS) und der Verschlüsselung von gespeicherten Daten auf Speichermedien oder in einem Cloud-Speicher.","title":"ITS Verschlüsselung","files":[]},{"id":"[[RM_Risikobewertung]]","text":"Führen Sie eine Risikobewertung durch. Dazu können Sie unser Template nutzen und für Ihren Fall anpassen. \n\nDownload des Templates.","title":"RM Risikobewertung","files":[]},{"id":"[[RM_Involvierung-Betroffene]]","text":"Versuchen Sie, in einer frühen Ideen-Phase des Projekts, Betroffene zu befragen, was sie von der Idee, in diesem Fall KI einzusetzen, halten.","title":"RM Involvierung-Betroffene","files":[]},{"id":"[[RM_Risikoneubewertung]]","text":"Eine wiederholte Risikobewertung im weiteren Verlauf der Entwicklung und des Betriebs des KI-Einsatzes ermöglicht es, veränderte Rahmenbedingungen (z.B. neue Gesetze, technologische Veränderungen, personelle Veränderungen) zu erkennen und darauf mit Maßnahmen zu reagieren.","title":"RM Risikoneubewertung","files":[]},{"id":"[[RM_Test]]","text":"Testen Sie Ihre KI-Lösung ausgiebig. Unbedingt auch mit bewusst falschen Eingaben.","title":"RM Test","files":[]},{"id":"[[RM_Involvierung-FB]]","text":"Während der KI-Entwicklung sollten Sie den nutzenden Fachbereich involvieren. Es bietet sich ein Lead-User-Konzept an. Diese Lead-User können später im Betrieb auch die KI-Lösung überwachen und weiterbetreuen.","title":"RM Involvierung-FB","files":[]}]}